const settingsTh = {
    diameter: 'Диаметр, cм.',
    height: 'Высота, см.',
    cakeWeightUpToTight: 'Вес торта до обтяжки, гр.',
    standWeight: 'Вес подставки, гр.',
    leveledCakeWeight: 'Вес выровненного торта, гр.',
    weightOfCoveredCake: 'Вес обтянутого торта, гр.',
};

const settingsText = [
    [
        'Для более корректного отображения всех расчетов в программе предусмотрена возможность учитывать индивидуальные параметры каждого пользователя. Каждый кондитер делает обтяжку торта мастикой разной толщины. То же самое касается и выравнивания кремом. По умолчанию программа учитывает примерный усредненный результат. Но каждый пользователь может произвести проработку, зафиксировать данные в программе по расчету тортов и тогда будут учитываться в расчете ваши индивидуальные параметры. Таким образом вы сможете получить на выходе более точный результат.',
        'Для проработки толщины мастики:',
        'Перед тем как начать проработку толщины мастики (а так же выравнивающего крема) зафиксируйте размер яруса на котором вы будете производить отработку, лучше использовать самый часто используемый вами размер торта (не сильно маленький и не сильно большой), самый оптимальный размер 18 см диаметр 7 см высота. Так же зафиксируйте вес самого торта (начинки) а так же вес подставки которую вы используете для выравнивания яруса (если вы не используете подставки, поставьте в таблицу ниже значение 0).',
    ],
    [
        'Произведите выравнивание торта, то как вы это делаете обычно, взвесьте получившийся результат (включает в себя начинку, подставку под торт и выравнивающий крем).',
        'Произведите обтяжку торта мастикой, так же зафиксируйте результат. После заполнения таблицы не забудьте нажать кнопку «сохранить».',
        'Для проработки толщины крема:',
        'Обычно для изготовления кремового торта, в сравнении с мастичным используют более толстый слой крема, потому что он является финишным слоем. Когда идет речь о выравнивании слоем крема под мастику, то здесь необходимо только лишь выровнять поверхность и поэтому мы используют максимально тонкий слой крема (сквозь крем могут проглядывать какие-то части начинки, бисквита и т.л.) именно поэтому мы предусмотрели отдельные настройки для кремового торта.',
        'В точно такой же последовательности произведите проработку. Зафиксируйте все данные в таблицу ниже.',
    ],
];

export { settingsTh, settingsText };
